# Exp7: Prior-as-Attention + C3k2_Dental (ECA), P3-P5 detection
# 4ch → PriorAsAttentionInput → 3ch → Backbone with ECA → 3-scale Detect
#
# Changes vs yolo11-dental-attn.yaml (Exp5):
#   - All C3k2 replaced with C3k2_Dental (C3k2 + EfficientChannelAttention)

nc: 3
ch: 4
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, PriorAsAttentionInput, [multiply]]    # 0: 4ch → 3ch
  - [-1, 1, Conv, [64, 3, 2]]                     # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                    # 2-P2/4
  - [-1, 2, C3k2_Dental, [256, False, 0.25]]      # 3 ← ECA
  - [-1, 1, Conv, [256, 3, 2]]                    # 4-P3/8
  - [-1, 2, C3k2_Dental, [512, False, 0.25]]      # 5 ← ECA
  - [-1, 1, Conv, [512, 3, 2]]                    # 6-P4/16
  - [-1, 2, C3k2_Dental, [512, True]]             # 7 ← ECA
  - [-1, 1, Conv, [1024, 3, 2]]                   # 8-P5/32
  - [-1, 2, C3k2_Dental, [1024, True]]            # 9 ← ECA
  - [-1, 1, SPPF, [1024, 5]]                      # 10
  - [-1, 2, C2PSA, [1024]]                        # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
  - [[-1, 7], 1, Concat, [1]]                     # 13: cat P4
  - [-1, 2, C3k2_Dental, [512, False]]            # 14 ← ECA

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
  - [[-1, 5], 1, Concat, [1]]                     # 16: cat P3
  - [-1, 2, C3k2_Dental, [256, False]]            # 17 (P3/8) ← ECA

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [[-1, 14], 1, Concat, [1]]                    # 19
  - [-1, 2, C3k2_Dental, [512, False]]            # 20 (P4/16) ← ECA

  - [-1, 1, Conv, [512, 3, 2]]                    # 21
  - [[-1, 11], 1, Concat, [1]]                    # 22
  - [-1, 2, C3k2_Dental, [1024, True]]            # 23 (P5/32) ← ECA

  - [[17, 20, 23], 1, Detect, [nc]]               # Detect(P3, P4, P5)
