# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 Dental Detection Model - 4-channel input for Stage2 lesion detection
# Input channels: [I_raw, M_virtual, DistanceMap, M_metal]

# Parameters
nc: 3  # number of classes: periapical, periodontal, combined lesions
ch: 4  # input channels (4-channel: raw + stage1 priors)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # YOLO11n-dental
  s: [0.50, 0.50, 1024]  # YOLO11s-dental
  m: [0.50, 1.00, 512]   # YOLO11m-dental
  l: [1.00, 1.00, 512]   # YOLO11l-dental
  x: [1.00, 1.50, 512]   # YOLO11x-dental

# YOLO11-Dental backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2  - First conv accepts 4 channels
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# YOLO11-Dental head with DentalChannelAttention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 2, C3k2, [512, False]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 2, C3k2, [256, False]]         # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]          # cat head P4
  - [-1, 2, C3k2, [512, False]]         # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]          # cat head P5
  - [-1, 2, C3k2, [1024, True]]         # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]     # Detect(P3, P4, P5)
