# Exp8: Prior-as-Attention Full Model (PriorAsAttn + P2 + ECA)
# 4ch → PriorAsAttentionInput → 3ch → Backbone with P2 + ECA → 4-scale Detect
#
# Combines all structural improvements on top of Prior-as-Attention:
#   - PriorAsAttentionInput: prior modulates RGB via spatial attention
#   - P2 head: 4x downsample detection for small lesions
#   - C3k2_Dental: ECA channel attention throughout

nc: 3
ch: 4
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, PriorAsAttentionInput, [multiply]]    # 0: 4ch → 3ch
  - [-1, 1, Conv, [64, 3, 2]]                     # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                    # 2-P2/4
  - [-1, 2, C3k2_Dental, [128, False, 0.25]]      # 3 - P2 block + ECA
  - [-1, 1, Conv, [256, 3, 2]]                    # 4-P3/8
  - [-1, 2, C3k2_Dental, [256, False, 0.25]]      # 5 ← ECA
  - [-1, 1, Conv, [512, 3, 2]]                    # 6-P4/16
  - [-1, 2, C3k2_Dental, [512, True]]             # 7 ← ECA
  - [-1, 1, Conv, [1024, 3, 2]]                   # 8-P5/32
  - [-1, 2, C3k2_Dental, [1024, True]]            # 9 ← ECA
  - [-1, 1, SPPF, [1024, 5]]                      # 10
  - [-1, 2, C2PSA, [1024]]                        # 11

head:
  # Top-down: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
  - [[-1, 7], 1, Concat, [1]]                     # 13: cat backbone P4
  - [-1, 2, C3k2_Dental, [512, False]]            # 14 ← ECA

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
  - [[-1, 5], 1, Concat, [1]]                     # 16: cat backbone P3
  - [-1, 2, C3k2_Dental, [256, False]]            # 17 (P3/8) ← ECA

  # P3 → P2 (new)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
  - [[-1, 3], 1, Concat, [1]]                     # 19: cat backbone P2
  - [-1, 2, C3k2_Dental, [128, False]]            # 20 (P2/4) ← ECA

  # Bottom-up: P2 → P3
  - [-1, 1, Conv, [128, 3, 2]]                    # 21
  - [[-1, 17], 1, Concat, [1]]                    # 22: cat head P3
  - [-1, 2, C3k2_Dental, [256, False]]            # 23 (P3/8) ← ECA

  # P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]                    # 24
  - [[-1, 14], 1, Concat, [1]]                    # 25: cat head P4
  - [-1, 2, C3k2_Dental, [512, False]]            # 26 (P4/16) ← ECA

  # P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]                    # 27
  - [[-1, 11], 1, Concat, [1]]                    # 28: cat backbone P5
  - [-1, 2, C3k2_Dental, [1024, True]]            # 29 (P5/32) ← ECA

  - [[20, 23, 26, 29], 1, Detect, [nc]]           # Detect(P2, P3, P4, P5)
