# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-Dental with Prior-as-Attention fusion
#
# Architecture:
#   4ch input → PriorAsAttentionInput → 3ch (RGB with prior guidance) → Standard YOLO11
#
# Key difference from yolo11-dental.yaml:
#   - Prior channels don't go through early convolutions
#   - Prior is converted to spatial attention and applied to RGB
#   - Preserves prior's semantic meaning
#
# Input: 4 channels [I_raw, M_virtual, Distance, M_metal]

nc: 3  # number of classes: periapical, periodontal, combined
scales:
  s: [0.50, 0.50, 1024]

# Custom input channels
ch: 4

backbone:
  # First layer: Convert 4ch to 3ch via learned prior attention
  - [-1, 1, PriorAsAttentionInput, [multiply]]  # 0: (B,4,H,W) -> (B,3,H,W)

  # Standard YOLO11 backbone (now receives 3ch)
  - [-1, 1, Conv, [64, 3, 2]]     # 1: P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 2: P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3
  - [-1, 1, Conv, [256, 3, 2]]    # 4: P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5
  - [-1, 1, Conv, [512, 3, 2]]    # 6: P4/16
  - [-1, 2, C3k2, [512, True]]    # 7
  - [-1, 1, Conv, [1024, 3, 2]]   # 8: P5/32
  - [-1, 2, C3k2, [1024, True]]   # 9
  - [-1, 1, SPPF, [1024, 5]]      # 10
  - [-1, 2, C2PSA, [1024]]        # 11

head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]]     # 13: cat P4
  - [-1, 2, C3k2, [512, False]]   # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]     # 16: cat P3
  - [-1, 2, C3k2, [256, False]]   # 17 (P3/8)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]]    # 18
  - [[-1, 14], 1, Concat, [1]]    # 19: cat
  - [-1, 2, C3k2, [512, False]]   # 20 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]    # 21
  - [[-1, 11], 1, Concat, [1]]    # 22: cat
  - [-1, 2, C3k2, [1024, True]]   # 23 (P5/32)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
